-- 运用此程序集实现的不同 SQL 对象的查询示例

-----------------------------------------------------------------------------------------
-- 存储过程
-----------------------------------------------------------------------------------------
-- exec StoredProcedureName


-----------------------------------------------------------------------------------------
-- 用户定义的函数
-----------------------------------------------------------------------------------------
-- select dbo.FunctionName()


-----------------------------------------------------------------------------------------
-- 用户定义的类型
-----------------------------------------------------------------------------------------
-- CREATE TABLE test_table (col1 UserType)
-- go
--
-- INSERT INTO test_table VALUES (convert(uri, 'Instantiation String 1'))
-- INSERT INTO test_table VALUES (convert(uri, 'Instantiation String 2'))
-- INSERT INTO test_table VALUES (convert(uri, 'Instantiation String 3'))
--
-- select col1::method1() from test_table



-----------------------------------------------------------------------------------------
-- 用户定义的类型
-----------------------------------------------------------------------------------------
-- select dbo.AggregateName(Column1) from Table1


select '要运行项目，请编辑项目中的 Test.sql 文件。此文件位于解决方案资源管理器的 Test Scripts 文件夹中。'